hello-world.yml
config:
  target: https://scorekeeperdev.azurewebsites.net/Login
  phases:
  - duration: 5
    arrivalRate: 1
    rampTo: 1
    name: Warm up the API
  - duration: 10
    arrivalRate: 2
    rampTo: 1
    name: Ramp up to peak load
  - duration: 15
    arrivalRate: 3
    rampTo: 1
    name: Sustained peak load
  payload:
    - path: ./UserCsv-vk.csv
      fields:
        - "UserName"
        - "Password"
      skipHeader: true
  # Enable the Playwright engine:
  engines:
    playwright:
      defaultTimeout: 600000
      launchOptions:
        headless: true
  processor: "./flows.js"
scenarios:
  - engine: playwright
    flowFunction: "helloFlow"
    flow: []